# panda

[official docs](https://pandas.pydata.org/)

In [1]:
import pandas as pd

atlantis_df =pd.read_csv('../data/atlantis.csv')
atlantis_df

    year  population
0   2000       12400
1   2001       12800
2   2002       13800
3   2003       13600
4   2004       14200
5   2005       15600
6   2006       17600
7   2007       19200
8   2008       20300
9   2009       20800
10  2010       21200
11  2011       22400
12  2012       23400
13  2013       24500
14  2014       25800
15  2015       26100
16  2016       28300
17  2017       29600
18  2018       32100
19  2019       32500
20  2020       33200
21  2021       33800

In [2]:
atlantis_df.head()

   year  population
0  2000       12400
1  2001       12800
2  2002       13800
3  2003       13600
4  2004       14200

In [3]:

atlantis_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        22 non-null     int64
 1   population  22 non-null     int64
dtypes: int64(2)
memory usage: 480.0 bytes

In [4]:
atlantis_df.dtypes

year          int64
population    int64
dtype: object

In [5]:
atlantis_df.describe()

              year    population
count    22.000000     22.000000
mean   2010.500000  22418.181818
std       6.493587   7100.411548
min    2000.000000  12400.000000
25%    2005.250000  16100.000000
50%    2010.500000  21800.000000
75%    2015.750000  27750.000000
max    2021.000000  33800.000000

In [6]:
atlantis_df.shape

(22, 2)

In [7]:
atlantis_df.columns

Index(['year', 'population'], dtype='object')

In [8]:
atlantis_df['year'].head()

0    2000
1    2001
2    2002
3    2003
4    2004
Name: year, dtype: int64

In [9]:
new_df = pd.DataFrame({
    'year': atlantis_df['year'],
    'population': atlantis_df['population'],
    'remarks': 1
})
new_df.head()

   year  population  remarks
0  2000       12400        1
1  2001       12800        1
2  2002       13800        1
3  2003       13600        1
4  2004       14200        1

In [10]:
new_df[['year', 'population']].head()

   year  population
0  2000       12400
1  2001       12800
2  2002       13800
3  2003       13600
4  2004       14200

## query lines by loc or iloc

In [11]:
atlantis_df.loc[0]

year           2000
population    12400
Name: 0, dtype: int64

In [12]:
atlantis_df.loc[0, 'year']

2000

In [13]:
atlantis_df.iloc[0]

year           2000
population    12400
Name: 0, dtype: int64

In [14]:
atlantis_df.iloc[0, 0]

2000

## query by condition

In [15]:
atlantis_df[atlantis_df['population'] > 30000]

    year  population
18  2018       32100
19  2019       32500
20  2020       33200
21  2021       33800

In [16]:
atlantis_df[(atlantis_df['population'] > 30000) & (atlantis_df['year'] <= 2020)]

    year  population
18  2018       32100
19  2019       32500
20  2020       33200

## modify line

In [17]:
atlantis_df.loc[20, 'population'] = 20000
atlantis_df.loc[20]

year           2020
population    20000
Name: 20, dtype: int64

## insert column

In [18]:
new_df.head()

   year  population  remarks
0  2000       12400        1
1  2001       12800        1
2  2002       13800        1
3  2003       13600        1
4  2004       14200        1

In [19]:
new_df['remarks1'] = ['High' if pop > 30000 else 'Low' for pop in new_df['population']]
new_df.head()

   year  population  remarks remarks1
0  2000       12400        1      Low
1  2001       12800        1      Low
2  2002       13800        1      Low
3  2003       13600        1      Low
4  2004       14200        1      Low

## add new row

In [22]:
# .iloc is strictly positional and cannot create new rows.
# new_df.iloc[22] = [2022, 45000, 1, 'High']

# use loc to create new rows
new_df.loc[22] = [2022, 45000, 1, 'High']
new_df.tail()

    year  population  remarks remarks1
18  2018       32100        1     High
19  2019       32500        1     High
20  2020       33200        1     High
21  2021       33800        1     High
22  2022       45000        1     High

In [ ]:
## best practice for pipelines
new_row = pd.DataFrame([[2023, 46000, 1, 'High']], columns=new_df.columns)
pd.concat([new_df, new_row], ignore_index=True).tail()

    year  population  remarks remarks1
19  2019       32500        1     High
20  2020       33200        1     High
21  2021       33800        1     High
22  2022       45000        1     High
23  2023       46000        1     High

## drop column or line

In [ ]:
new_df.drop(columns=['remarks']).head()

In [ ]:
new_df.drop(index=0)
new_df.describe()

## handling na values

In [ ]:
new_df.isna().head()

In [ ]:
new_df.dropna(inplace=True)
new_df.head()

In [ ]:
new_df['na_col'] = [None for _ in range(len(new_df))]
new_df.head()

In [ ]:
print(new_df.fillna(0).head())

In [ ]:
# Fill NA/NaN values by propagating the last valid observation to next valid.
# https://pandas.pydata.org/pandas-docs/version/2.1/reference/api/pandas.DataFrame.ffill.html#pandas.DataFrame.ffill
print(new_df.ffill().head())

## order

In [ ]:
new_df.sort_values(by='population', ascending=False).head()

In [ ]:
new_df.drop_duplicates().head()

In [ ]:
new_unique_unique_unique_unique_unique_df.groupby('remarks1').agg({'population': 'mean'})

## apply and map

In [ ]:
new_df['population'] = new_df['population'].map(lambda x: x + 1000)
new_df.dtypes

In [ ]:
new_df.apply(lambda row: row['population'] * 2 if row['remarks1'] == 'High' else row['population'], axis=1).tail()

In [ ]:
new_df['remarks1'].str.upper().head()

In [ ]:
new_df['remarks1'].str.contains('HIGH').head()

In [ ]:
new_df['remarks1'].str.replace('HIGH', 'VERY HIGH').tail()

## time

In [ ]:
new_df['date'] = pd.to_datetime(new_df['year'], format='%Y')
new_df.head()

In [ ]:
new_df['real_year'] = new_df['date'].dt.year
new_df.head()

In [ ]:
new_df['real_month'] = new_df['date'].dt.month
new_df.head()

## save to files

In [ ]:
new_df.to_csv('../data/atlantis_modified.csv', index=False)
new_df.to_json('../data/atlantis_modified.json')
new_df.to_excel('../data/atlantis_modified.xlsx', index=False)

## some field in DataFrame

[DataFrame](https://pandas.pydata.org/pandas-docs/version/2.1/reference/frame.html)

In [27]:
new_df.values

array([[2000, 12400, 1, 'Low'],
       [2001, 12800, 1, 'Low'],
       [2002, 13800, 1, 'Low'],
       [2003, 13600, 1, 'Low'],
       [2004, 14200, 1, 'Low'],
       [2005, 15600, 1, 'Low'],
       [2006, 17600, 1, 'Low'],
       [2007, 19200, 1, 'Low'],
       [2008, 20300, 1, 'Low'],
       [2009, 20800, 1, 'Low'],
       [2010, 21200, 1, 'Low'],
       [2011, 22400, 1, 'Low'],
       [2012, 23400, 1, 'Low'],
       [2013, 24500, 1, 'Low'],
       [2014, 25800, 1, 'Low'],
       [2015, 26100, 1, 'Low'],
       [2016, 28300, 1, 'Low'],
       [2017, 29600, 1, 'Low'],
       [2018, 32100, 1, 'High'],
       [2019, 32500, 1, 'High'],
       [2020, 33200, 1, 'High'],
       [2021, 33800, 1, 'High'],
       [2022, 45000, 1, 'High']], dtype=object)

In [28]:
new_df.axes

[Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
        18, 19, 20, 21, 22],
       dtype='int64'),
 Index(['year', 'population', 'remarks', 'remarks1'], dtype='object')]

In [29]:
new_df.ndim

2

In [32]:
new_df.size

92

In [ ]:
# (rows, columns)
new_df.shape

(23, 4)

In [49]:
new_df.memory_usage(True, False)
# Index         740

Index         740
year          184
population    184
remarks       184
remarks1      184
dtype: int64

In [50]:
new_df.memory_usage(True, True)

Index          740
year           184
population     184
remarks        184
remarks1      1385
dtype: int64

In [51]:
new_df.empty

False

# 用 Pandas 处理一个用户行为日志 CSV（去重、填充缺失值、时间窗口统计）。

In [11]:
import pandas as pd

df = pd.read_csv("../data/pandas_test.csv")
# ensure event_time is datetime
df["event_time"] = pd.to_datetime(df["event_time"])

# 明确定义“重复”的判定规则
# 规则 R1：完全重复（Exact Duplicate）
r1_keys = ["user_id", "event_type", "event_time", "page", "duration"]
df_r1 = df.drop_duplicates(subset=r1_keys, keep="first")
df_r1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 19 entries, 0 to 20
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     19 non-null     int64
 1   event_type  19 non-null     object
 2   event_time  19 non-null     datetime64[ns]
 3   page        19 non-null     object
 4   duration    9 non-null      float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 912.0+ bytes

In [13]:
# 规则 R3：时间容忍重复（Time-window Duplicate）
# # ensure event_time is datetime
df_r1 = df_r1.sort_values(["user_id", "event_type", "event_time"])

time_window = pd.Timedelta(seconds=60)
# shift the previous event_time for same user + event_type
df_r1["prev_time"] = df_r1.groupby(["user_id", "event_type"])["event_time"].shift(1)

# calculate time difference
df_r1["time_diff"] = df_r1["event_time"] - df_r1["prev_time"]

# mark duplicates within the window
df_r1["is_r3_duplicate"] = df_r1["time_diff"] <= time_window

# filter out duplicates
df_r3 = df_r1[~df_r1["is_r3_duplicate"]].copy()

# drop helper columns
df_r3 = df_r3.drop(columns=["prev_time", "time_diff", "is_r3_duplicate"])

df_r3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 18 entries, 11 to 14
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     18 non-null     int64
 1   event_type  18 non-null     object
 2   event_time  18 non-null     datetime64[ns]
 3   page        18 non-null     object
 4   duration    9 non-null      float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 864.0+ bytes

In [14]:
# 规定缺失值的填充策略
mean_by_event = (
    df_r3
    .dropna(subset=["duration"])
    .groupby("event_type")["duration"]
    .mean()
)

global_mean = df_r3["duration"].mean()
# 先按分组的均值填充，如果还是空，则按全局均值填充
df_r3["duration"] = (
    df_r3["duration"]
        .fillna(df_r3["event_type"].map(mean_by_event))
        .fillna(global_mean)
)

In [15]:
df_r3

    user_id event_type          event_time     page   duration
11     1001      click 2024-06-01 09:25:48   search   7.000000
0      1001      login 2024-06-01 09:00:01     home   7.666667
15     1001     logout 2024-06-01 10:05:00     home   7.666667
6      1001       view 2024-06-01 09:10:05   search   5.000000
5      1002      click 2024-06-01 09:06:10  product   6.250000
10     1002     logout 2024-06-01 09:20:00     home   7.666667
3      1002       view 2024-06-01 09:03:15  product  12.000000
16     1002       view 2024-06-01 10:07:45   search   4.000000
8      1003      click 2024-06-01 09:15:33  product   3.000000
17     1003     logout 2024-06-01 10:10:00     home   7.666667
4      1003       view 2024-06-01 09:05:42  product   8.000000
18     1004      click 2024-06-01 10:15:20  product   6.000000
7      1004      login 2024-06-01 09:12:00     home   7.666667
12     1004       view 2024-06-01 09:30:10  product  15.000000
19     1005      click 2024-06-01 10:18:55  product   9.000000
13     1005      login 2024-06-01 10:01:00     home   7.666667
20     1005     logout 2024-06-01 10:25:00     home   7.666667
14     1005       view 2024-06-01 10:02:30  product   8.800000

In [16]:
# 指定统计窗口和输出指标
# --- Step 2: Set a fixed aggregation window ---
window = "30min"  # can be "1H", "15min", etc.
df_r3.set_index("event_time", inplace=True)

# --- Step 3: Aggregate metrics ---
agg_df = (
    df_r3.groupby([pd.Grouper(freq=window), "event_type"])
      .agg(
          event_count=("user_id", "count"),
          mean_duration=("duration", "mean"),
          unique_users=("user_id", pd.Series.nunique)
      )
      .reset_index()
)

In [17]:
agg_df

           event_time event_type  event_count  mean_duration  unique_users
0 2024-06-01 09:00:00      click            3       5.416667             3
1 2024-06-01 09:00:00      login            2       7.666667             2
2 2024-06-01 09:00:00     logout            1       7.666667             1
3 2024-06-01 09:00:00       view            3       8.333333             3
4 2024-06-01 09:30:00       view            1      15.000000             1
5 2024-06-01 10:00:00      click            2       7.500000             2
6 2024-06-01 10:00:00      login            1       7.666667             1
7 2024-06-01 10:00:00     logout            3       7.666667             3
8 2024-06-01 10:00:00       view            2       6.400000             2